## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] has changed
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Storage/storageAccounts/findatppr379logs"
        name                              = "findatppr379logs"
        tags                              = {
            "Environment"      = "pr-379"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "104.45.204.53",
              + "172.177.155.149",
                # (1 unchanged element hidden)
            ]
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-379applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-379httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be updated in-place
  ~ resource "azurerm_linux_web_app" "default" {
      ~ app_settings                      = {
          + "AppLogging:DefaultLogEventLevel"                 = "Debug"
          + "AppLogging:OverrideLogEventLevel"                = "Information"
          - "AppLogging_DefaultLogEventLevel"                 = "Debug" -> null
          - "AppLogging_OverrideLogEventLevel"                = "Information" -> null
          + "BlobStorage:AccountName"                         = "s177p01sharedtpdata"
          + "BlobStorage:ClientId"                            = "fdd09510-77b0-419f-b67c-2b5a25a073f0"
          + "BlobStorage:ContainerName"                       = "ntp-tp-data"
          + "BlobStorage:TenantId"                            = "9c7d9dd3-840c-4b3f-818e-552865082e16"
          - "BlobStorage_AccountName"                         = "s177p01sharedtpdata" -> null
          - "BlobStorage_ClientId"                            = "fdd09510-77b0-419f-b67c-2b5a25a073f0" -> null
          - "BlobStorage_ContainerName"                       = "ntp-tp-data" -> null
          - "BlobStorage_TenantId"                            = "9c7d9dd3-840c-4b3f-818e-552865082e16" -> null
          + "DfeAnalytics:CredentialsJsonFile"                = "dfe-analytics-credentials.json"
          + "DfeAnalytics:DatasetId"                          = "fatp_events_development"
          + "DfeAnalytics:ProjectId"                          = "find-a-tuition-partner"
          - "DfeAnalytics_CredentialsJsonFile"                = "dfe-analytics-credentials.json" -> null
          - "DfeAnalytics_DatasetId"                          = "fatp_events_development" -> null
          - "DfeAnalytics_ProjectId"                          = "find-a-tuition-partner" -> null
          + "EmailSettings:AllSentToEnquirer"                 = "true"
          + "EmailSettings:AmalgamateResponses"               = "true"
          + "EmailSettings:MergeResponses"                    = "true"
          - "EmailSettings_AllSentToEnquirer"                 = "true" -> null
          - "EmailSettings_AmalgamateResponses"               = "true" -> null
          - "EmailSettings_MergeResponses"                    = "true" -> null
            # (15 unchanged elements hidden)
        }
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Web/sites/find-a-tp-pr-379"
        name                              = "find-a-tp-pr-379"
        tags                              = {
            "Environment"      = "pr-379"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (18 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          ~ application_logs {
                # (1 unchanged attribute hidden)

              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ http_logs {
              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_key_vault[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_key_vault" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-379-kv|find-a-tp-pr-379-default-kv-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-379-default-kv-diag"
        # (2 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_redis_cache[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_redis_cache" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Cache/redis/find-a-tp-pr-379-redis-cache|find-a-tp-pr-379-default-redis-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-379-default-redis-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "web_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Storage/storageAccounts/findatppr379logs|find-a-tp-pr-379-storage-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-379-storage-diag"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.webhook[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "webhook" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Logic/workflows/find-a-tp-pr-379-webhook-workflow|find-a-tp-pr-379-webhook-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-379-webhook-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379"
        name     = "s177d01-ntp-pr-379"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-379"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "logs" {
        id                         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Storage/storageAccounts/findatppr379logs"
      ~ ip_rules                   = [
          - "172.177.155.149",
            # (1 unchanged element hidden)
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.
```
</details>